# Pandas

Pandas is a library built using NumPy specifically for data analysis. You'll be using Pandas heavily for data manipulation, visualisation, building machine learning models, etc. 

There are two main data structures in Pandas - Series and Dataframes. The default way to store data is dataframes, and thus manipulating dataframes quickly is probably the most important skill set for data analysis. 

<img src="pandas_1.png">

*source: https://pandas.pydata.org/pandas-docs/stable/overview.html*

In this section, you will study:
1. The pandas Series (similar to a numpy array)
    * Creating a pandas series
    * Indexing series
2. Dataframes 
    * Creating dataframes from dictionaries
    * Importing CSV data files as pandas dataframes
    * Reading and summarising dataframes
    * Sorting dataframes

### 1. The Pandas Series 

A series is similar to a 1-D numpy array, and contains scalar values of the same type (numeric, character, datetime etc.). 
A dataframe is simply a table where each column is a pandas series.

#### Creating Pandas Series

Series are one-dimensional array-like structures, though unlike numpy arrays, they often contain non-numeric data (characters, dates, time, booleans etc.)

You can create pandas series from array-like objects using ```pd.Series()```.

In [3]:
# import pandas, pd is an alias
import pandas as pd

# Creating a numeric pandas series
s = pd.Series([2, 4, 5, 6, 'a'])
print(s)
print(type(s))

0    2
1    4
2    5
3    6
4    a
dtype: object
<class 'pandas.core.series.Series'>

Note that each element in the Series has an index, and the index starts at 0 as usual.

In [4]:
# creating a series of characters
# notice that the 'dtype' here is 'object'
char_series = pd.Series(['a', 'b', 'af'])
char_series

0     a
1     b
2    af
dtype: object

In [6]:
# creating a series of type datetime
date_series = pd.date_range(start = '11-09-2017', end = '12-12-2017')
print(date_series)
type(date_series)

DatetimeIndex(['2017-11-09', '2017-11-10', '2017-11-11', '2017-11-12',
               '2017-11-13', '2017-11-14', '2017-11-15', '2017-11-16',
               '2017-11-17', '2017-11-18', '2017-11-19', '2017-11-20',
               '2017-11-21', '2017-11-22', '2017-11-23', '2017-11-24',
               '2017-11-25', '2017-11-26', '2017-11-27', '2017-11-28',
               '2017-11-29', '2017-11-30', '2017-12-01', '2017-12-02',
               '2017-12-03', '2017-12-04', '2017-12-05', '2017-12-06',
               '2017-12-07', '2017-12-08', '2017-12-09', '2017-12-10',
               '2017-12-11', '2017-12-12'],
              dtype='datetime64[ns]', freq='D')

pandas.core.indexes.datetimes.DatetimeIndex

#### Indexing Series

Indexing series is exactly same as 1-D numpy arrays - index starts at 0.

In [7]:
# Indexing pandas series: Same as indexing 1-d numpy arrays or lists
# accessing the fourth element
s[3]

# accessing elements starting index = 2 till the end
s[2:]

2    5
3    6
4    a
dtype: object

In [8]:
# accessing the second and the fourth elements
# note that s[1, 3] will not work, you need to pass the indices [1, 3] as a list inside the original []
s[[1, 3]]

1    4
3    6
dtype: object

Usually, you will work with Series only as a part of dataframes. Let's study the basics of dataframes.

### The Pandas Dataframe

Dataframe is the most widely used data-structure in data analysis. It is a table with rows and columns, with rows having an index and columns having meaningful names.

#### Creating dataframes from dictionaries

There are various ways of creating dataframes, such as creating them from dictionaries, JSON objects, reading from txt, CSV files, etc.

In [9]:
# keys become column names
df = pd.DataFrame({'name': ['Vinay', 'Kushal', 'Aman', 'Saif'], 
                   'age': [22, 25, 24, 28], 
                    'occupation': ['engineer', 'doctor', 'data analyst', 'teacher']})
df

     name  age    occupation
0   Vinay   22      engineer
1  Kushal   25        doctor
2    Aman   24  data analyst
3    Saif   28       teacher

#### Importing CSV data files as pandas dataframes 

For the upcoming exercises, we will use a dataset of a retail store having details about the orders placed, customers, product details, sales, profits etc.

In [11]:
# reading a CSV file as a dataframe
market_df = pd.read_csv("cust_dimen.csv")

Usually, dataframes are imported as CSV files, but sometimes it is more convenient to convert dictionaries 
into dataframes. For e.g. when the raw data is in a JSON format (which is not uncommon), you can easily convert it into a dictionary, and then into a dataframe. 

You will learn how to convert JSON objects to dataframes later.

#### Reading and Summarising Dataframes

After you import a dataframe, you'd want to quickly understand its structure, shape, meanings of rows and columns etc. Further, you may want to look at summary statistics - such as mean, percentiles etc.

In [12]:
# Looking at the top and bottom entries of dataframes
market_df.head()

        Customer_Name Province   Region Customer_Segment Cust_id
0  MUHAMMED MACINTYRE  NUNAVUT  NUNAVUT   SMALL BUSINESS  Cust_1
1        BARRY FRENCH  NUNAVUT  NUNAVUT         CONSUMER  Cust_2
2       CLAY ROZENDAL  NUNAVUT  NUNAVUT        CORPORATE  Cust_3
3      CARLOS SOLTERO  NUNAVUT  NUNAVUT         CONSUMER  Cust_4
4        CARL JACKSON  NUNAVUT  NUNAVUT        CORPORATE  Cust_5

In [13]:
market_df.tail()

        Customer_Name Province Region Customer_Segment    Cust_id
1827   NICOLE BRENNAN  ALBERTA   WEST         CONSUMER  Cust_1828
1828    JASON FORTUNE  ALBERTA   WEST        CORPORATE  Cust_1829
1829     HARRY GREENE  ALBERTA   WEST        CORPORATE  Cust_1830
1830  GRANT DONATELLI  ALBERTA   WEST         CONSUMER  Cust_1831
1831       MICK BROWN  ALBERTA   WEST         CONSUMER  Cust_1832

Here, each row represents an order placed at a retail store. Notice the index associated with each row - starts at 0 and ends at 8398, implying that there were 8399 orders placed.

In [14]:
# Looking at the datatypes of each column
market_df.info()

# Note that each column is basically a pandas Series of length 8399
# The ID columns are 'objects', i.e. they are being read as characters
# The rest are numeric (floats or int)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1832 entries, 0 to 1831
Data columns (total 5 columns):
Customer_Name       1832 non-null object
Province            1832 non-null object
Region              1832 non-null object
Customer_Segment    1832 non-null object
Cust_id             1832 non-null object
dtypes: object(5)
memory usage: 71.6+ KB

In [15]:
# Describe gives you a summary of all the numeric columns in the dataset
market_df.describe()

       Customer_Name Province Region Customer_Segment    Cust_id
count           1832     1832   1832             1832       1832
unique           795       13      8                4       1832
top     ERIC BARRETO  ONTARIO   WEST        CORPORATE  Cust_1333
freq              13      337    382              662          1

In [16]:
# Column names
market_df.columns

Index(['Customer_Name', 'Province', 'Region', 'Customer_Segment', 'Cust_id'], dtype='object')

In [17]:
# The number of rows and columns
market_df.shape

(1832, 5)

In [18]:
# You can extract the values of a dataframe as a numpy array using df.values 
market_df.values

array([['MUHAMMED MACINTYRE', 'NUNAVUT', 'NUNAVUT', 'SMALL BUSINESS',
        'Cust_1'],
       ['BARRY FRENCH', 'NUNAVUT', 'NUNAVUT', 'CONSUMER', 'Cust_2'],
       ['CLAY ROZENDAL', 'NUNAVUT', 'NUNAVUT', 'CORPORATE', 'Cust_3'],
       ...,
       ['HARRY GREENE', 'ALBERTA', 'WEST', 'CORPORATE', 'Cust_1830'],
       ['GRANT DONATELLI', 'ALBERTA', 'WEST', 'CONSUMER', 'Cust_1831'],
       ['MICK BROWN', 'ALBERTA', 'WEST', 'CONSUMER', 'Cust_1832']],
      dtype=object)

#### Indices 

An important concept in pandas dataframes is that of *row indices*. By default, each row is assigned indices starting from 0, and are represented at the left side of the dataframe.

In [19]:
market_df.head()

        Customer_Name Province   Region Customer_Segment Cust_id
0  MUHAMMED MACINTYRE  NUNAVUT  NUNAVUT   SMALL BUSINESS  Cust_1
1        BARRY FRENCH  NUNAVUT  NUNAVUT         CONSUMER  Cust_2
2       CLAY ROZENDAL  NUNAVUT  NUNAVUT        CORPORATE  Cust_3
3      CARLOS SOLTERO  NUNAVUT  NUNAVUT         CONSUMER  Cust_4
4        CARL JACKSON  NUNAVUT  NUNAVUT        CORPORATE  Cust_5

Now, arbitrary numeric indices are difficult to read and work with. Thus, you may want to change the indices of the df to something more meanigful.

Let's change the index to Ord_id (unique id of each order), so that you can select rows using the order ids directly.

In [21]:
# Setting index to Ord_id
market_df.set_index('Cust_id', inplace = True)
market_df.head()

              Customer_Name Province   Region Customer_Segment
Cust_id
Cust_1   MUHAMMED MACINTYRE  NUNAVUT  NUNAVUT   SMALL BUSINESS
Cust_2         BARRY FRENCH  NUNAVUT  NUNAVUT         CONSUMER
Cust_3        CLAY ROZENDAL  NUNAVUT  NUNAVUT        CORPORATE
Cust_4       CARLOS SOLTERO  NUNAVUT  NUNAVUT         CONSUMER
Cust_5         CARL JACKSON  NUNAVUT  NUNAVUT        CORPORATE

Having meaningful row labels as indices helps you to select (subset) dataframes easily. You will study selecting dataframes in the next section.

#### Sorting dataframes

You can sort dataframes in two ways - 1) by the indices and 2) by the values.

In [26]:
# Sorting by index
# axis = 0 indicates that you want to sort rows (use axis=1 for columns)
market_df.sort_index(axis = 0, ascending = True).head()

,Customer_Name,Province,Region,Customer_Segment
Cust_id,,,,
Cust_1,MUHAMMED MACINTYRE,NUNAVUT,NUNAVUT,SMALL BUSINESS
Cust_10,CLAUDIA MINER,NUNAVUT,NUNAVUT,SMALL BUSINESS
Cust_100,CHARLOTTE MELTON,NORTHWEST TERRITORIES,NORTHWEST TERRITORIES,HOME OFFICE
Cust_1000,JANE WACO,ONTARIO,ONTARIO,CORPORATE
Cust_1001,SANDRA FLANAGAN,ONTARIO,ONTARIO,HOME OFFICE

In [25]:
# Sorting by values

# Sorting in increasing order of Sales
market_df.sort_values(by='Cust_id').head()

,Customer_Name,Province,Region,Customer_Segment
Cust_id,,,,
Cust_1,MUHAMMED MACINTYRE,NUNAVUT,NUNAVUT,SMALL BUSINESS
Cust_10,CLAUDIA MINER,NUNAVUT,NUNAVUT,SMALL BUSINESS
Cust_100,CHARLOTTE MELTON,NORTHWEST TERRITORIES,NORTHWEST TERRITORIES,HOME OFFICE
Cust_1000,JANE WACO,ONTARIO,ONTARIO,CORPORATE
Cust_1001,SANDRA FLANAGAN,ONTARIO,ONTARIO,HOME OFFICE

In [30]:
# Sorting in decreasing order of Shipping_Cost
market_df.sort_values(by='Cust_id', ascending = True).head()

,Customer_Name,Province,Region,Customer_Segment
Cust_id,,,,
Cust_1,MUHAMMED MACINTYRE,NUNAVUT,NUNAVUT,SMALL BUSINESS
Cust_10,CLAUDIA MINER,NUNAVUT,NUNAVUT,SMALL BUSINESS
Cust_100,CHARLOTTE MELTON,NORTHWEST TERRITORIES,NORTHWEST TERRITORIES,HOME OFFICE
Cust_1000,JANE WACO,ONTARIO,ONTARIO,CORPORATE
Cust_1001,SANDRA FLANAGAN,ONTARIO,ONTARIO,HOME OFFICE

In [32]:
# Sorting by more than two columns

# Sorting in ascending order of Sales for each Product
market_df.sort_values(by=['Cust_id', 'Customer_Name'], ascending = True).head()

,Customer_Name,Province,Region,Customer_Segment
Cust_id,,,,
Cust_1,MUHAMMED MACINTYRE,NUNAVUT,NUNAVUT,SMALL BUSINESS
Cust_10,CLAUDIA MINER,NUNAVUT,NUNAVUT,SMALL BUSINESS
Cust_100,CHARLOTTE MELTON,NORTHWEST TERRITORIES,NORTHWEST TERRITORIES,HOME OFFICE
Cust_1000,JANE WACO,ONTARIO,ONTARIO,CORPORATE
Cust_1001,SANDRA FLANAGAN,ONTARIO,ONTARIO,HOME OFFICE